org/20230120183543-probabilistic_programming.org
:PROPERTIES:
:ID:       b3595b63-582d-4bee-b26e-02c958a05ffa
:END:
#+title: Probabilistic Programming

* References

- [[https://arxiv.org/abs/1601.04943][Semantics for probabilistic programming]]
- [[https://arxiv.org/abs/2106.02686][Ensemble Markov chain Monte Carlo with teleporting walkers]]
- [[http://www.stat.columbia.edu/~gelman/bayescomputation/lunnbugswithcomments.pdf][The BUGS project: Evolution, critique and future directions]]

* Model representation and compilation

- [[https://arxiv.org/abs/2010.09647v2][The base measure problem and its solution]]
- [[https://dl.acm.org/doi/fullHtml/10.1145/3374208][Symbolic disintegration with a variety of base measures]]
- [[https://legacy.cs.indiana.edu/ftp/techreports/TR719.pdf][Simplifying probabilistic programs using computer algebra]]
- [[https://arxiv.org/abs/1805.06562][From high-level inference algorithms to efficient code]]

* Inference compilation

- [[https://www.repository.cam.ac.uk/bitstream/handle/1810/295167/thesis.pdf?sequence=1&isAllowed=y][Formally justified and modular Bayesian inference for probabilistic programs]]
- [[http://approximateinference.org/accepted/ScibiorGhahramani2016.pdf][Modular construction of Bayesian inference algorithms]]
