20230120183543-probabilistic_programming.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-12-28 Thu 21:52 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Probabilistic Programming</title>
<meta name="author" content="Rémi Louf" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="style.css" /></head>
<body>
<div id="content" class="content">
<h1 class="title">Probabilistic Programming</h1>

<div id="outline-container-orgd508e1a" class="outline-2">
<h2 id="orgd508e1a">References</h2>
<div class="outline-text-2" id="text-orgd508e1a">
<ul class="org-ul">
<li><a target='_blank' rel='noopener noreferrer' class='external' href="https://arxiv.org/abs/1601.04943">Semantics for probabilistic programming</a></li>
<li><a target='_blank' rel='noopener noreferrer' class='external' href="https://arxiv.org/abs/2106.02686">Ensemble Markov chain Monte Carlo with teleporting walkers</a></li>
<li><a target='_blank' rel='noopener noreferrer' class='external' href="http://www.stat.columbia.edu/~gelman/bayescomputation/lunnbugswithcomments.pdf">The BUGS project: Evolution, critique and future directions</a></li>
</ul>
</div>
</div>

<div id="outline-container-org56387d6" class="outline-2">
<h2 id="org56387d6">Model representation and compilation</h2>
<div class="outline-text-2" id="text-org56387d6">
<ul class="org-ul">
<li><a target='_blank' rel='noopener noreferrer' class='external' href="https://arxiv.org/abs/2010.09647v2">The base measure problem and its solution</a></li>
<li><a target='_blank' rel='noopener noreferrer' class='external' href="https://dl.acm.org/doi/fullHtml/10.1145/3374208">Symbolic disintegration with a variety of base measures</a></li>
<li><a target='_blank' rel='noopener noreferrer' class='external' href="https://legacy.cs.indiana.edu/ftp/techreports/TR719.pdf">Simplifying probabilistic programs using computer algebra</a></li>
<li><a target='_blank' rel='noopener noreferrer' class='external' href="https://arxiv.org/abs/1805.06562">From high-level inference algorithms to efficient code</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgf43181b" class="outline-2">
<h2 id="orgf43181b">Inference compilation</h2>
<div class="outline-text-2" id="text-orgf43181b">
<ul class="org-ul">
<li><a target='_blank' rel='noopener noreferrer' class='external' href="https://www.repository.cam.ac.uk/bitstream/handle/1810/295167/thesis.pdf?sequence=1&amp;isAllowed=y">Formally justified and modular Bayesian inference for probabilistic programs</a></li>
<li><a target='_blank' rel='noopener noreferrer' class='external' href="http://approximateinference.org/accepted/ScibiorGhahramani2016.pdf">Modular construction of Bayesian inference algorithms</a></li>
</ul>
</div>
</div>

<div id="outline-container-org6469737" class="outline-2">
<h2 id="org6469737">Links to this note</h2>
</div>
</div>
</body>
</html>
